{
  "title": "Layout Shift",
  "caption": "Cumulative Layout Shift (CLS) is an important, user-centric metric for measuring visual stability because it helps quantify how often users",
  "content": "<h2 style=\"text-align: left;\"><strong>What is CLS?</strong></h2>\r\n<p style=\"text-align: left;\">As the name suggests, Cumulative Layout Shift takes into account website elements that shift unexpectedly in the layout of a web page. Have you ever been on a web page and read the article in front of you, and the text suddenly moves to another area of the page? Or maybe you were about to click a button, but the moment you do, it moves and you click another link? Or if you loaded a page and, while you were reading it, the banner loads and the page jumps down, that would constitute a large CLS score.</p>\r\n<p style=\"text-align: left;\">Elements that can shift and dance around the page include images, videos, fonts, buttons, contact forms, and other types of content. If your website is suffering from a poor CLS score, you need to improve this aspect &ndash; otherwise, your visitors are going to be left with a poor user experience.</p>\r\n<h2 style=\"text-align: left;\"><strong>How does CLS impact user experience?</strong></h2>\r\n<p style=\"text-align: left;\">Page shifts occur when content loads at different speeds, causing the layout to change and the viewer to see something different. CLS can significantly impact user experience. Simply having an element shift on a button can cause someone to click on the wrong link, taking them to the wrong web page, and resulting in a poor user experience on your website.</p>\r\n<p style=\"text-align: left;\">Nowadays, users do not expect to wait until a web page loads and all the elements fit in the right place. They expect instant results. So, if your pages do not achieve a high-quality CLS score and elements shift before they settle, this will annoy your visitors.</p>\r\n<h2 style=\"text-align: left;\"><strong>What is a good CLS score?</strong></h2>\r\n<p style=\"text-align: left;\">You don&rsquo;t have to measure CLS yourself because Google makes it easy to analyze your page performance with their PageSpeed Insights tool, or in the Chrome browser using Lighthouse Tools. Below is a summary of Google's CLS Score guidelines:</p>\r\n<ul>\r\n<li style=\"list-style-type: none;\">\r\n<ul>\r\n<li style=\"text-align: left;\"><strong>Good </strong>- nothing to do here = 0.1 score or less</li>\r\n<li style=\"text-align: left;\"><strong>Needs improvement</strong> = Between 0.1 and 0.25 score</li>\r\n<li style=\"text-align: left;\"><strong>Poor</strong> = Over 0.25 score</li>\r\n</ul>\r\n</li>\r\n</ul>\r\n<p style=\"text-align: left;\">To analyze performance using Lighthouse tools:</p>\r\n<ol>\r\n<li style=\"list-style-type: none;\">\r\n<ol style=\"text-align: left;\">\r\n<li>Open up the website you want to analyze in Chrome.</li>\r\n<li>Navigate to Developer Tools by clicking the three dots in the top right corner of the browser window, choosing &ldquo;More Tools&rdquo; and then &ldquo;Developer Tools.&rdquo;</li>\r\n<li>Pick \"Lighthouse\" from the menu selections at the top of the console when it opens.</li>\r\n<li>Click &ldquo;Generate Report.&rdquo;</li>\r\n</ol>\r\n</li>\r\n</ol>\r\n<p style=\"text-align: left;\">The page below shows a CLS of 0.063, which is below 0.1, so it&rsquo;s a Good CLS score.</p><img src=\"/blog1.png\" width=700 height=420 alt=\"nextPOC\" />\r\n<p style=\"text-align: left;\">A \"good\" CLS score is the goal - Google recommends that you keep it below 0.1. It is possible to achieve a CLS score of 0 with fully static pages.</p>\r\n<p style=\"text-align: left;\">A \"needs improvement\" score is a solid sign that you can eventually achieve the \"good\" score, necessary to ultimately gain Google's approval.</p>\r\n<p style=\"text-align: left;\">However, if your score is \"poor\" and your CLS is above 0.25, you need to take the necessary steps to improve the layout shift of your page - more on that below.</p>\r\n<img src=\"/blog2.png\" width=700 height=180 alt=\"nextPOC\" /><h2 style=\"text-align: left;\"><strong>How is CLS measured?</strong></h2>\r\n<p style=\"text-align: left;\">Below <a href=\"https://web.dev/cls/#layout-shift-score\">Google</a>&nbsp;explains the calculation of the CLS score:</p>\r\n<p style=\"text-align: left;\"><em>&ldquo;To calculate the layout shift score, the browser looks at the viewport size and the movement of unstable elements in the viewport between two rendered frames. The layout shift score is a product of two measures of that movement: the impact fraction and the distance fraction (both defined below):&nbsp;layout shift score = impact fraction * distance fraction&rdquo;</em></p>\r\n<p style=\"text-align: left;\">As previously established, CLS is calculated using the formula below:</p>\r\n<p style=\"text-align: left;\"><em>&ldquo;Layout shift score = impact fraction * distance fraction&rdquo;</em></p>\r\n<p style=\"text-align: left;\">Let us take a closer look at the 2 factors involved in CLS.</p>\r\n<h3 style=\"text-align: left;\"><strong>Impact fraction</strong></h3>\r\n<p style=\"text-align: left;\">The impact fraction refers to the size of the unstable element compared to the viewport</p>\r\n<p style=\"text-align: left;\">This is calculated with the following formula:</p>\r\n<p style=\"text-align: left;\"><em>&ldquo;Area of impact region/area of viewport = impact fraction&rdquo;</em></p>\r\n<h3 style=\"text-align: left;\"><strong>Distance fraction</strong></h3>\r\n<p style=\"text-align: left;\">The distance fraction is the amount by which the unstable element moves in relation to the viewport.</p>\r\n<p style=\"text-align: left;\">This is calculated with the following formula:</p>\r\n<p style=\"text-align: left;\"><em>&ldquo;Max move distance/viewport height = distance fraction&rdquo;</em></p>\r\n<p style=\"text-align: left;\">Thus, a high CLS would consist of a large element moving over a long distance. A small CLS would be the result of a small element moving only over a small distance.</p>\r\n<h2 style=\"text-align: left;\"><strong>How can CLS be improved?</strong></h2>\r\n<p style=\"text-align: left;\">Now you are aware of what CLS is, what a good score looks like, and how this component is determined. How can I raise my CLS score? This is a query that you might now want an answer to. With this in mind, here are some important steps to improve your CLS score if needed:</p>\r\n<p><strong>1. Add dimensions for images and videos</strong></p>\r\n<p style=\"text-align: left;\">Dimensions, i.e. height and width elements, are helpful when it comes to your images and videos. If you have not specified dimensions, this has caused a problem with CLS: It causes unnecessary shifts because the media is a dynamic approach rather than fixed. If you assign height and width attributes to your images/videos, you can prevent them from jumping back and forth unnecessarily on the page.</p>\r\n<p><strong>2. A caution with web-based fonts</strong></p>\r\n<p style=\"text-align: left;\">Using web fonts that you have downloaded may result in Flash of Invisible Text. FOIT can cause white space to appear before the downloaded font is displayed. Simply put, this is not good for your efforts to reduce the impact of CLS.</p>\r\n<p style=\"text-align: left;\">Fortunately, correcting the situation is rather easy when using web-based fonts. In the link used for the web font download, simply add a &lt;link rel=preload&gt; to preload the font files and download them as a priority asset.</p>\r\n<p><strong>3. Use transitions and animation to provide context around page changes</strong></p>\r\n<p style=\"text-align: left;\">For example, a \"read more\" link that scrolls the user down the page would not affect the CLS because it is an expected layout shift.</p>\r\n<p style=\"text-align: left;\">CLS only takes into account unexpected changes. There is no effect on CLS if the layout changes as a result of a user-initiated action. This is a helpful tool if you do not need to load everything at once. Instead, use \"read more\" buttons or \"expand topic\" accordions on your page to let visitors select the sections they wish to see.</p>\r\n<p><strong>4. Reducing layout shifts caused by ads, embeds, and iframes</strong></p>\r\n<p style=\"text-align: left;\">To reduce layout shifts due to ads, embeds, and iframes, do the following:</p>\r\n<ul style=\"text-align: left;\">\r\n<li>Before loading the ad library, reserve the (largest available) slot size for the ads.</li>\r\n<li>Move ads down or out of the viewport.</li>\r\n<li>Use placeholders when no display is available.</li>\r\n</ul>\r\n<p><strong>5. Avoiding inserting new content above existing content</strong></p>\r\n<p style=\"text-align: left;\">Unless in reaction to user activity, try to stay away from placing dynamic material (such as banners, forms, etc.) above already existing content. This helps prevent unexpected layout shifts.</p>\r\n<h2 style=\"text-align: left;\"><strong>In conclusion</strong></h2>\r\n<p style=\"text-align: left;\">Paying attention to CLS not only provides a better user experience but also boosts your search result rankings.To meet Google standards for CLS, first, use a diagnostic tool to measure the current performance of your website. Take into account the basic guidelines, and keep layout shifts top of mind when designing your website, especially around transitions and content additions. With these few simple considerations, you will consistently get better results.</p>\r\n<p style=\"text-align: left;\">&nbsp;</p>\r\n<p style=\"text-align: left;\"><strong>&nbsp;</strong></p>\r\n<p style=\"text-align: left;\">&nbsp;</p>\r\n<p style=\"text-align: left;\">&nbsp;</p>",
  "author": "- Ganesh Sonawane (Senior Associate, Front-End)",
  "slug": "layout-shift"
}
